** Run Code Under org-mode
 在org-mode下运行程序并输出结果首先要在初始脚本.emacs下使能相应代码，比如使能
 elisp和python的脚本如下：
 (org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

 然后在org文件中按照格式写出运行程序，以python为例:
#+BEGIN_SRC python :results output
i=0
while(i<3):
  print('how are you? emacs & python')
  i=i+1
#+END_SRC

运行程序时，光标在代码部分时执行[C-c C-c]，如下：

#+BEGIN_SRC python :results output
i=0
while(i<3):
  print('how are you? emacs & python')
  i=i+1
#+END_SRC

#+RESULTS:
: how are you? emacs & python
: how are you? emacs & python
: how are you? emacs & python
